<?php


//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                              Файл с функциями перевода числа в письменный формат.                              //
//                     Данный файл помогает перевести число цифровом формате в прописной формат                   //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//  

include "function/DblInWords.php";

//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                         	     Файл с функциями для работы реестором			                  //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//  



include "function/reg.php";



//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                          	Функция переводит текстовый формат месяца в числовой		          //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------//                                            
// $input0 - строка "месяц".	                                                           		  	  //  
//----------------------------------------------------------------------------------------------------------------//
function mounth_num($input0){

	$rett="12";

	if($input0 == "Январь"){
		$rett = "01";
	}elseif($input0 == "Февраль"){
		$rett = "02";
	}elseif($input0 == "Март"){
		$rett = "03";
	}elseif($input0 == "Апрель"){
		$rett = "04";
	}elseif($input0 == "Май"){
		$rett = "05";
	}elseif($input0 == "Июнь"){
		$rett = "06";
	}elseif($input0 == "Июль"){
		$rett = "07";
	}elseif($input0 == "Август"){
		$rett = "08";
	}elseif($input0 == "Сентябрь"){
		$rett = "09";
	}elseif($input0 == "Октябрь"){
		$rett = "10";
	}elseif($input0 == "Ноябрь"){
		$rett = "11";
	}elseif($input0 == "Декабрь"){
		$rett = "12";
	}else{
		$rett = "123";
	}

	return $rett;
}

//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                          	Функция округления числа с заменой вместо NULL		                          //
//   	  	                   Данная функция помогает подключится в БД MS SQL 	 		          //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// $input0 - число для округления;                                                                                //  
// $input1 - количество знаков после запятой;                                                                     //    
// $input2 - строка для замены.	                                                           		  	  //  
//----------------------------------------------------------------------------------------------------------------//

function FormatEx($input0,$input1,$input2)
{
	// Проверка является ли элемент $input0 пустым или нет
	// Если нет, то округляем его до $input1 знака после запятой
	if ($input0 != NULL)
        {
           return number_format($input0, $input1, '.', ''); 
        }
	else
	{
	   return $input2;
	}
}



//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                          		    Функция подключения к бд 			                          //
//   	  	                   Данная функция помогает подключится в БД MS SQL 	 		          //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// $servername - имя сервера;                                                                                     //  
// $Database   - наименование БД;	                                                                          //    
// $UID        - имя пользователя;                                                            		          //    
// $PWD        - пароль.                                                                		          //  
//----------------------------------------------------------------------------------------------------------------//
function connectBD($ServerName,$Database,$UID,$PWD)
{
	 // Записываем в  $serv_db массив со значениями БД, именем пользователя и паролем
	 $serv_db =  'sqlsrv:server=' . $ServerName . ';Database=' . $Database;     
	 // если попытка удачная то возвращаем подключение и дальше можно с ним работать
	Try 
	{     
		// попытка соединения к бд
	 	$conn = new PDO($serv_db, $UID, $PWD); 

	}       
	catch(PDOException $e) 
	{  
    		die ("<div class=\"success fred\">".$e->getMessage()."</div>");  	
	}
		
}


//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                          		    Функция замены строки в файле		                          //
//   	  	                   Данная функция заменяет нужную строку в файле 	 		          //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// $filename - название файла;                                                                                    //  
// $replace  - строка для замены;	                                                                          //    
// $line     - номер строки.                                                                		          //  
//----------------------------------------------------------------------------------------------------------------//

function replace_file($filename, $replace, $line)
{ 
	// открытие файла с названием $filename для записи 
	$file = file($filename); 
	$open = fopen($filename,"w"); 
 
	// заменяем определенные строки элементами из $replace
  	 for($i=0;$i<count($file);$i++) 
  	 { 
  	    if(($i+1)!=$line){fwrite($open,$file[$i]);} 
  	    else{fwrite($open,$replace."\r\n");} 
  	 } 
 
	fclose($open);  
}


//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                              Функция отображения обозначения нейти в необходимом формате.                      //
//   Данная функция переводит обозначение нефти в целочисленном формате в необходимый формат по ГОСТу Р 51858     //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// item0 - целочисленная значная строка;                                                                          //  
// item1 - начало оборота знака в формате HTML;                                                                   //    
// item1 - конец оборота знака в формате HTML.                                                                    //  
//----------------------------------------------------------------------------------------------------------------//

function OilLabel($item0, $item1, $item2)
{
	$Result = "";
	$Prev   = $item1;
	$Post   = $item2;
	$dim    = 1000;

	$Label  = $item0;
	$Export = $Label / 10000;
	$Label %= 10000;

	for($ii = 3; $ii >= 0; --$ii)
	{
		$Result = $Result . $Prev;
			
		if ($Label / $dim < 5) 
		{
			$Result = $Result . intval($Label / $dim); 
		}
		else 
		{
			$Result = $Result . "-";
		}
		$Label  = $Label % $dim;
		$dim    = $dim / 10;

		if($ii == 2 && $Export)
		{
			$Result = $Result . "э";
		}

		$Result =  $Result . $Post;

		if($ii > 0)
		{
			$Result = $Result . ".";
		}
	}

	return $Result;
}




//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                                      Функция перевода ФИО в формат ИОФ.                                        //
//              Данная функция переводит строку в формате "Фамилия И.О." в формат "И.О. Фамилия" и обратно.       //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// item0 - строка в формате "И.О. Фамилия" или  "Фамилия И.О.".                                                   //  
//----------------------------------------------------------------------------------------------------------------//

function FIOtoIOF($item0)
{
	// Заменяем ФИО на ИОФ с помощью функции explode, которая преобразует строку в массив с помощью пробела
	list($F, $IO) = explode(" ", $item0);
	return $IO ." " . $F;
}



?>