<?php                                   

//----------------------------------------------------------------------------------------------------------------//      
//                  			  Глобальный переменные:                                                  //
//----------------------------------------------------------------------------------------------------------------//       
// arr1  - массив строк с числами от 1 до 9 для муж. и ср. рода                                                   //
// arr2  - массив строк с числами от 1 до 9 для женского рода                                                     //
// arr3  - массив строк с 1000 округлителем                                                                       //
// arr10 - массив строк с числами от 10 до 19                                                                     //
// arr11 - массив строк с числами делителями 100                                                                  //
//----------------------------------------------------------------------------------------------------------------//


$arr11  = array("десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать");
$arr100 = array("сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот");
$arr10  = array("десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто");
$arr1   = array("один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять");
$arr2   = array("одна","две","три","четыре","пять","шесть","семь","восемь","девять");
$arr3   = array(array(" тысяча "  , " тысячи "   , " тысяч "     ),
    	        array(" миллион " , " миллиона " , " миллионов " ),
	        array(" миллиард ", " миллиарда ", " миллиардов "),
	        array(" триллион ", " триллиона ", " триллионов "));


//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                            Функция перевода 3 значиного числа в письменный формат.                             //
//              Данная функция переводит 3 значное число в цифровом формате в прописной формат                    //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// ii   - число в цифровом формате. (например 999999)                                                             //
// flag - число в женский или мужской род (true - женский, false мужской)                                         //
//----------------------------------------------------------------------------------------------------------------//


function Anom1000($ii, $flag = false)
{
	global $arr11,$arr100, $arr10, $arr1, $arr2;
	$ss = "";

	$i1 = $ii % 10;
	$i3 = intval($ii / 100);
	$i2 = intval($i1 / 10 - $i3 * 10);

	$i1 = $ii % 10;
	$i3 = intval($ii / 100);
	$i2 = intval($ii / 10) - $i3 * 10;
	
	if($i3 > 0)
	{
		$ss = $arr100[$i3 - 1] . ' ';
	}
	if(1 == $i2)
	{
		return $ss . $arr11[$i1];
	}

	if($i2 > 0)
	{
		$ss = $ss . $arr10[$i2 - 1] . ' ';
	}

	if($i1 > 0)
	{
		$ss = $ss . (($flag) ? $arr2[$i1 - 1] : $arr1[$i1 - 1]);
	}

	return $ss;
};


//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                         Функция перевода целочисленного числа в письменный формат.                             //
//                     Данная функция переводит число в цифровом формате в прописной формат                       //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// val  - число в цифровом формате от 1. (например 999999)                                                        //
// flag - число в цифровом формате от 1. (например 999999)                                                        //
//----------------------------------------------------------------------------------------------------------------//


function CalcDblInWords($val, $flag)
{
	global $arr3;
	$ss = "";
	$ii = $val;

	$ss = Anom1000($ii % 1000, $flag);
	
	if(0 == ($ii = intval($ii / 1000)))
	{
		return $ss;
	}

	for($nn = 0; $nn < 4; ++$nn)
	{
		$jj = $ii % 10;  // Единицы
		$kk = $ii % 100; // Десятки

		// Окончание "тысяч"
		$postfix = 2;

		// Окончание "тысяча"
		if($jj == 1 && ($kk < 10 || $kk > 19)) $postfix = 0;

		// Окончание "тысячи"
		if($jj >= 2 && $jj <= 4 && ($kk < 10 || $kk > 20)) $postfix = 1;

		$ss = Anom1000($ii % 1000, $nn == 0) . $arr3[$nn][$postfix] . $ss;

		if(0 == ($ii = intval($ii / 1000))) return $ss;
	}

	return ss;
}

?>