
//----------------------------------------------------------------------------------------------------------------//
//                                                                                                                //
//                           Функция скрытия и появления левой панели DocViewer.                                  //
//          		    Данная функция переносит панель либо влево, либо вправо    				  //
//                                                                                                                //
//----------------------------------------------------------------------------------------------------------------//
//                                             Входные переменные:                                                //
//----------------------------------------------------------------------------------------------------------------// 
// item0 - строка в формате "И.О. Фамилия" или  "Фамилия И.О.".                                                   //  
//----------------------------------------------------------------------------------------------------------------//


$(document).ready(function(){		  
	$("div.slide_panel p.open").toggle(function(){
		// нажмешь один раз, панель скроется за экран на 341 пиксель
		$("div.container").animate({'padding-left': "60px" },500);
		$("div.slide_panel").animate({left:'-341px'},500);

	}, function() {
		// нажмешь второй раз, панель вернется на своё начальное положение 0
		$("div.container").animate({'padding-left': "401px"},500);
		$("div.slide_panel").animate({left:'0'},500);
	}); 
});


